TECHNICAL.org
#+TITLE: Internals and literate programming setup
#+LANGUAGE: en

This file documents the internals of daggerlib: the literate
programming setup, tangling pipeline, and editor configuration. See
[[file:readme.org][readme.org]] for an introduction.

* Module entry point
  :PROPERTIES:
  :ID:       48120ecb-7e3c-4cdb-8856-8304b784e40e
  :END:

  The =__init__.py= simply re-exports the =Lib= class:

  #+begin_src python :tangle src/lib/__init__.py
  """Reusable container helpers: base images, timezone, user setup, DinD, etc."""

  from .main import Lib as Lib
  #+end_src

  The =main.py= defines the =@object_type= class that composes all the
  functions defined in the use-case org files. Besides image versions,
  the class carries a =default_username= field so the container user
  is defined once and overridable globally — individual functions
  default to =None= and fall back to =self.default_username=. The
  =timezone= field (default =Europe/Paris=) controls which timezone is
  set in all container variants.

  #+begin_src python :tangle src/lib/main.py
  """Reusable container helpers: base images, timezone, user setup, DinD, etc."""

  from dagger import function, object_type

  from .alpine import (
      alpine,
      alpine_python,
      alpine_python_user_venv,
      alpine_set_tz,
      alpine_tz,
      alpine_user,
  )
  from .debian import (
      debian,
      debian_apt_cleanup,
      debian_localtime,
      debian_no_auto_install,
      debian_python_user_venv,
      debian_set_tz,
      debian_user,
  )
  from .python import python_user_venv, python_venv
  from .dind import (
      dind_container,
      dind_emacs_container,
      dind_init_examples,
      dind_run_org,
      dind_run_tests,
      dind_tangle,
      dind_with_docker,
      emacs_container,
      export_html,
  )
  from .distroless import distroless_debian, distroless_python3_debian, distroless_set_tz
  from .flask_venv import flask_venv
  from .pip_tools import pip_tools
  from .ralph import ralph
  from .user import as_user, setup_user, use_user


  @object_type
  class Lib:
      alpine_version: str = "3.23"
      debian_version: str = "13"
      debian_min_version: str = "2"
      pip_tools_python_version: str = "3.12"
      default_username: str = "sam"
      timezone: str = "Europe/Paris"
      dind_ubuntu_image: str = "ubuntu:24.04"

      # Alpine
      alpine_set_tz = alpine_set_tz
      alpine = alpine
      alpine_user = alpine_user
      alpine_tz = alpine_tz
      alpine_python = alpine_python
      alpine_python_user_venv = alpine_python_user_venv

      # Debian
      @property
      def debian_tag(self) -> str:
          return f"{self.debian_version}.{self.debian_min_version}-slim"

      debian_no_auto_install = debian_no_auto_install
      debian_set_tz = debian_set_tz
      debian_apt_cleanup = debian_apt_cleanup
      debian = debian
      debian_user = debian_user
      debian_python_user_venv = debian_python_user_venv
      debian_localtime = debian_localtime

      # Python
      python_venv = python_venv
      python_user_venv = python_user_venv

      # Distroless
      distroless_set_tz = distroless_set_tz
      distroless_python3_debian = distroless_python3_debian
      distroless_debian = distroless_debian

      # User
      setup_user = setup_user
      as_user = as_user
      use_user = use_user

      # Pip tools
      pip_tools = pip_tools

      # Flask
      flask_venv = flask_venv

      # Emacs container (lightweight, no Docker)
      emacs_container = emacs_container

      # DinD
      dind_container = dind_container
      dind_emacs_container = dind_emacs_container
      dind_with_docker = dind_with_docker
      dind_run_tests = dind_run_tests
      dind_run_org = dind_run_org
      dind_tangle = dind_tangle
      dind_init_examples = dind_init_examples
      export_html = export_html

      # Ralph
      ralph = ralph
  #+end_src

* Module context

  The =.daggerignore= keeps volatile or large files out of the Dagger
  module context. Without it, the 230 MB =.tangle-deps/= directory
  (fetched by the tangling pipeline) would be sent as part of the
  module source on every =dagger call=, invalidating the cache whenever
  it changes.

  Note that =.tangle-deps/= is always mounted as a cache volume inside
  the container (see [[file:src/dind.org][dind.org]]), so excluding it from the module
  context loses nothing.

  #+begin_src text :tangle .daggerignore :comments no
  .git
  .pytest_cache
  .ruff_cache
  .claude
  CLAUDE.md
  .tangle-deps
  __pycache__
  #+end_src

* Editor configuration
  :PROPERTIES:
  :ID:       d36cf7bf-faac-46a9-9150-4031c8f06ca6
  :END:

  The =.dir-locals.el= ensures that Emacs preserves Python indentation
  inside org code blocks. Without this, =C-c '= (org-edit-special) would
  re-indent Python code relative to the org heading level.

  #+begin_src emacs-lisp :tangle .dir-locals.el
    ((org-mode
      . ((org-babel-default-header-args:python
          . ((:preserve-indentation . t)))
         (org-id-link-to-org-use-id . nil)
         (eval . (load (expand-file-name "reproducibility-helpers.el"
                         (locate-dominating-file default-directory ".dir-locals.el"))
                       t)))))
  #+end_src

* Development

  The org files are the source of truth. The Python modules, test scripts,
  and =tangle.sh= itself are all generated. To regenerate everything from
  scratch:

  #+begin_src bash
  rm -rf src/lib/alpine.py src/lib/debian.py src/lib/dind.py \
         src/lib/distroless.py src/lib/flask_venv.py src/lib/pip_tools.py \
         src/lib/user.py src/lib/main.py src/lib/__init__.py \
         tests/*.sh tests/test_use_cases.py \
         tangle.sh tangle.el test.sh run.sh
  ./bootstrap.sh
  ./tangle.sh
  #+end_src

* Source directory convention

  Some functions need files from the module source tree (shell scripts,
  config files). There are two patterns depending on context.

** =dag.address(".")= for Lib functions (tested via the harness)

   =DefaultPath(".")= is resolved by the Dagger CLI, but the Python
   test harness calls functions directly — =DefaultPath= never fires.
   For functions that must work in both contexts, use an explicit
   =src: dagger.Directory | None = None= parameter with a fallback
   to =dag.address(".").directory()=:

   #+begin_src python :tangle no
   def my_function(
       self,
       src: dagger.Directory | None = None,
   ) -> dagger.Container:
       if src is None:
           src = dag.address(".").directory()
       return (
           dag.container().from_("...")
           .with_file("/tmp/script.sh", src.file("src/lib/script.sh"))
           .with_exec(["sh", "/tmp/script.sh"])
       )
   #+end_src

   This works everywhere:
   - =dagger call= (CLI resolves "." to the module context)
   - Python test harness (pytest resolves "." to the working directory)
   - Direct SDK usage (caller can pass any directory)

   The shell scripts themselves live in tangled =.sh= files under
   =src/lib/=, keeping shell code in shell and Python code in Python.


* Reproducibility helpers

  Helpers loaded both by =tangle.el= (batch) and =.dir-locals.el=
  (interactive), so tangling works the same way everywhere.

  Those MUST be kept as minimal as possible, to avoid drifting too far from
  vanilla.

  The ruff post-tangle hook ensures that Python files are formatted
  identically whether tangled from the command line or interactively.

  Each =dagger call= bash block carries a =#+NAME:= and tangles its
  command to =tests/commands/<name>= via =:tangle (daggerlib-auto-test)=.
  The function reads the block's name from =org-element-at-point= so
  the name appears only once in the org source.

  Expected output files (=tests/expected/<name>=) are generated
  automatically after tangling: =daggerlib--write-expected-files=
  scans the org buffer for =#+RESULTS:= lines matching each tangled
  command and writes them out.  This eliminates the separate
  =#+BEGIN_SRC org= expected blocks that previously required
  repeating the name.

  The test runner iterates over command files, runs each one, and
  compares stdout to the expected output.  Example tests
  (=examples/*/tests/=) run with =cwd= set to the example directory
  so =dagger call= loads the example module.

  #+begin_src emacs-lisp :tangle reproducibility-helpers.el
  ;;; reproducibility-helpers.el --- Tangle helpers for test commands

  (defun daggerlib--test-base-dir ()
    "Return the base directory for test files.
  For example org files (under examples/) use the example directory.
  For library org files (under src/) use the project root."
    (let* ((root (locate-dominating-file default-directory ".git"))
           (rel (file-relative-name default-directory root)))
      (if (string-prefix-p "examples/" rel)
          default-directory
        root)))

  (defun daggerlib-auto-test ()
    "Derive tangle path for test command from the block's #+NAME."
    (let ((name (org-element-property :name (org-element-at-point))))
      (unless name (error "daggerlib-auto-test: no #+NAME on this block"))
      (expand-file-name (concat "tests/commands/" name)
                        (daggerlib--test-base-dir))))

  (defun daggerlib--extract-result (name)
    "Extract cached #+RESULTS lines for NAME in current buffer."
    (save-excursion
      (goto-char (point-min))
      (when (re-search-forward
             (format "^[ \t]*#\\+RESULTS\\(?:\\[.*\\]\\)?:[ \t]+%s"
                     (regexp-quote name))
             nil t)
        (forward-line 1)
        (let ((lines nil))
          (while (looking-at "^[ \t]*: \\(.*\\)")
            (push (match-string-no-properties 1) lines)
            (forward-line 1))
          (when lines
            (mapconcat #'identity (nreverse lines) "\n"))))))

  (defun daggerlib--write-expected-files (tangled-files)
    "For each tangled command file, write expected output from #+RESULTS."
    (let ((root (locate-dominating-file default-directory ".git")))
      (dolist (f tangled-files)
        (when (string-match "/tests/commands/\\([^/]+\\)$" f)
          (let* ((name (match-string 1 f))
                 (result (daggerlib--extract-result name)))
            (when result
              (let* ((cmd-rel (file-relative-name f root))
                     (exp-rel (replace-regexp-in-string
                               "/commands/" "/expected/" cmd-rel))
                     (expected-file (expand-file-name exp-rel root)))
                (make-directory (file-name-directory expected-file) t)
                (with-temp-file expected-file
                  (insert result "\n"))
                (message "auto-expected: %s" expected-file))))))))

  ;;; reproducibility-helpers.el ends here
  #+end_src

