TECHNICAL.org
* Org-mode pin

  The scripts =bootstrap.sh= and =run.sh= clone a pinned org-mode
  commit. The pin lives in =.org-pin= (a plain file, not tangled)
  so it cannot diverge. The bash scripts inline the hash at tangle
  time via noweb.

  #+NAME: org-pin
  #+begin_src conf :tangle no :comments no :padline no
  1025e3b49a98f175b124dbccd774918360fe7e11
  #+end_src

  The =ensure-org= block checks that the cloned org-mode matches
  the pin and re-clones if needed. The shell scripts reference it
  via noweb.

  #+NAME: ensure-org
  #+begin_src bash :tangle no :noweb yes
  # Ensure pinned org-mode is cloned and up-to-date
  ORG_PIN="<<org-pin>>"
  ORG_DIR="$SCRIPT_DIR/.tangle-deps/org"
  if [ -d "$ORG_DIR" ] && [ "$(git -C "$ORG_DIR" rev-parse HEAD 2>/dev/null)" != "$ORG_PIN" ]; then
      echo "Org-mode pin changed, re-cloning..."
      rm -rf "$ORG_DIR"
  fi
  if [ ! -d "$ORG_DIR" ]; then
      echo "Cloning pinned org-mode ($ORG_PIN)..."
      mkdir -p "$SCRIPT_DIR/.tangle-deps"
      git clone --quiet https://git.savannah.gnu.org/git/emacs/org-mode.git "$ORG_DIR"
      git -C "$ORG_DIR" checkout --quiet "$ORG_PIN"
      # Generate org-loaddefs.el and org-version.el (needed for org to load properly)
      emacs --batch --no-init-file \
          --eval "(progn
                    (push \"$ORG_DIR/lisp\" load-path)
                    (require 'autoload)
                    (setq generated-autoload-file \"$ORG_DIR/lisp/org-loaddefs.el\")
                    (update-directory-autoloads \"$ORG_DIR/lisp\"))" 2>/dev/null
      ORG_GIT_VERSION=$(git -C "$ORG_DIR" describe --tags --match "release_*" 2>/dev/null || echo "N/A")
      ORG_RELEASE=$(echo "$ORG_GIT_VERSION" | sed 's/^release_//;s/-.*//')
      (cd "$ORG_DIR/lisp" && emacs --batch --no-init-file \
          --eval "(progn
                    (push \"$ORG_DIR/lisp\" load-path)
                    (load \"$ORG_DIR/mk/org-fixup.el\")
                    (org-make-org-version \"$ORG_RELEASE\"
                                          \"$ORG_GIT_VERSION\"))") 2>/dev/null || true
  fi
  #+end_src

* Tangle configuration
  :PROPERTIES:
  :ID:       0474ada9-a621-4c1a-97aa-270cf96e32c4
  :END:

  When =tangle.sh= runs Emacs in batch mode, it loads =tangle.el= to
  configure org-babel before tangling. This ensures that tangled files
  get link comments pointing back to their source block (=:comments yes=)
  and blank lines between blocks (=:padline yes=). It also loads a pinned
  org-mode version from =.tangle-deps/= for reproducibility and registers
  the bash and python babel languages.

  Batch Emacs cannot interact with the user. If org-babel encounters an
  unknown language with =:comments yes=, it tries to ask for the comment
  syntax and silently fails. We guard against this by making any
  interactive prompt a hard error in batch mode, so the problem surfaces
  immediately instead of producing a silent partial tangle.

  Since batch Emacs has no user init, packages like =nix-mode= are not
  available. We map the =nix= language to =conf-mode= so that org-babel
  recognises =#+begin_src nix= blocks for tangling without requiring an
  extra package.

  After tangling, an advice on =org-babel-tangle= calls
  =daggerlib--write-expected-files= to auto-generate
  =tests/expected/<name>= from =#+RESULTS:= lines for every block
  that tangled to =tests/commands/=.

  #+begin_src emacs-lisp :tangle tangle.el
  ;;; tangle.el --- Self-contained org-babel tangling for dagger lib -*- lexical-binding: t; -*-

  ;; Don't prompt for code block evaluation
  (setq org-confirm-babel-evaluate nil)

  ;; In batch mode, any interactive prompt means something is misconfigured
  ;; (e.g. unknown language with :comments yes).  Fail loudly instead of
  ;; hanging or silently skipping blocks.
  (when noninteractive
    (dolist (fn '(read-string read-from-minibuffer completing-read))
      (advice-add fn :before
                  (lambda (&rest _)
                    (error "Tangle aborted: batch Emacs cannot interact (check language modes in tangle.el)")))))

  ;; Load pinned org-mode from .tangle-deps BEFORE anything else loads the
  ;; built-in org.  This must happen before (require 'ob-shell) since that
  ;; transitively loads org.
  (let ((org-lisp-dir
         (expand-file-name ".tangle-deps/org/lisp"
                           (file-name-directory (or load-file-name buffer-file-name)))))
    (when (file-directory-p org-lisp-dir)
      (push org-lisp-dir load-path)
      (let ((contrib (expand-file-name "../contrib/lisp" org-lisp-dir)))
        (when (file-directory-p contrib)
          (push contrib load-path)))
      ;; Force load of pinned org (unload built-in if already loaded)
      (require 'org)))

  ;; Load babel languages needed for tangling
  (require 'ob-shell)
  (require 'ob-python)

  ;; Map nix to conf-mode so #+begin_src nix blocks tangle without nix-mode
  (add-to-list 'org-src-lang-modes '("nix" . conf))

  ;; Add link comments and blank lines between blocks in tangled output
  (setq org-babel-default-header-args
        (cons '(:comments . "yes")
              (cons '(:padline . "yes")
                    (assq-delete-all :comments
                      (assq-delete-all :padline
                        org-babel-default-header-args)))))

  ;; Preserve indentation in Python blocks so that org-level indentation
  ;; does not interfere with Python's significant whitespace.
  (add-to-list 'org-babel-default-header-args:python
               '(:preserve-indentation . t))

  ;; Load reproducibility helpers (shared with interactive Emacs
  ;; via .dir-locals.el).
  (load (expand-file-name "reproducibility-helpers.el"
           (file-name-directory (or load-file-name buffer-file-name)))
        t)

  ;; After tangling, auto-generate tests/expected/ files from #+RESULTS
  ;; for every block that tangled to tests/commands/.
  (advice-add 'org-babel-tangle :filter-return
              (lambda (files)
                (daggerlib--write-expected-files files)
                files))

  ;;; tangle.el ends here
  #+end_src

* Tangle script (host)
  :PROPERTIES:
  :ID:       a7c3e1f4-5b2d-4d8e-9f6a-2c1b3e4d5f6a
  :END:

  The host tangle script tangles all org files using host emacs.
  It reuses the same =tangle_file= function and =ensure-org= block
  as the bootstrap script, but tangles everything rather than just
  the bootstrap subset.  The daily-use =tangle.sh= wrapper runs this
  inside a container for reproducibility.

  #+begin_src bash :tangle tangle-host.sh :shebang "#!/usr/bin/env bash" :noweb yes
  # Tangle all org files.
  # Usage:
  #   ./tangle.sh                          # tangle all org files
  #   ./tangle.sh src/foo.org              # tangle a specific file
  set -euo pipefail

  SCRIPT_DIR="$(cd "$(dirname "$0")" && pwd)"

  <<ensure-org>>

  tangle_file() {
      local orgfile="$1"
      echo "Tangling $orgfile..."
      local raw_output tangled_list rc=0
      raw_output=$(emacs --batch --no-init-file \
          -l "$SCRIPT_DIR/tangle.el" \
          --eval "(progn
                    (require 'org)
                    (find-file \"$orgfile\")
                    (let ((files (org-babel-tangle)))
                      (dolist (f files) (princ (format \"%s\n\" f))))
                    (kill-buffer))" 2>&1) || rc=$?
      if [ "$rc" -ne 0 ]; then
          echo "ERROR: emacs tangle failed (exit $rc):" >&2
          echo "$raw_output" >&2
          return "$rc"
      fi
      tangled_list=$(echo "$raw_output" | grep -E '^/' || true)
      # Post-process tangled files
      for f in $tangled_list; do
          [ -f "$f" ] || continue
          # Strip trailing whitespace
          sed -i 's/[[:space:]]*$//' "$f"
          # Format Python files
          case "$f" in
              *.py) ruff format --quiet "$f" 2>/dev/null || true ;;
          esac
      done
  }

  if [ $# -eq 0 ]; then
      for f in "$SCRIPT_DIR"/readme.org "$SCRIPT_DIR"/TECHNICAL.org \
               "$SCRIPT_DIR"/src/*.org "$SCRIPT_DIR"/tests/*.org \
               "$SCRIPT_DIR"/examples/*/readme.org; do
          [ -f "$f" ] && tangle_file "$f"
      done
  else
      for f in "$@"; do
          tangle_file "$(realpath "$f")"
      done
  fi
  #+end_src

