TECHNICAL.org
* Run configuration
  :PROPERTIES:
  :ID:       0ee81e6f-f3c5-444a-9c36-ea8d777ede25
  :END:

  Like =tangle.el= configures tangling, =run.el= configures batch
  execution of org-babel blocks. It provides =dagger-run-file= to
  execute bash blocks (=dagger call= commands) and save the results.
  =dagger-run-ignore-cache= overrides =:cache= to ="no"= globally so
  that all blocks re-execute regardless of whether their content
  changed — useful when an external dependency changed but the block
  source didn't. The =dagger= wrapper in =tests/= handles
  suppressing TUI noise (see =testing.org=).

  #+begin_src emacs-lisp :tangle run.el
    ;;; run.el --- Batch-execute org-babel bash blocks -*- lexical-binding: t; -*-

    (defun dagger-run-file (orgfile &optional no-cache)
      "Execute bash blocks in ORGFILE.
When NO-CACHE is non-nil, ignore cached results."
      (find-file orgfile)
      (org-babel-map-src-blocks nil
        (when (and (string= lang "bash")
                   (not (assq :init (nth 2 (org-babel-get-src-block-info t)))))
          (message "%s Executing %s %s..." (format-time-string "%H:%M:%S") lang
                   (or (org-element-property :name (org-element-at-point)) "(unnamed)"))
          (if no-cache
              (org-babel-execute-src-block nil nil '((:cache . "no")))
            (org-babel-execute-src-block))))
      (save-buffer)
      (kill-buffer))

    (defvar dagger--block-error nil)

    (defun dagger--capture-error (exit-code stderr)
      "Advice: capture block failure details (ignore stderr-only warnings)."
      (when (and (numberp exit-code) (> exit-code 0))
        (setq dagger--block-error
              (format "exit %s:\n%s" exit-code (or stderr "")))))

    (defun dagger--execute-or-die (&optional info params)
      "Execute src block; signal error if it exits non-zero."
      (setq dagger--block-error nil)
      (advice-add 'org-babel-eval-error-notify :before #'dagger--capture-error)
      (unwind-protect
          (if (and info params)
              (org-babel-execute-src-block nil info params)
            (org-babel-execute-src-block))
        (advice-remove 'org-babel-eval-error-notify #'dagger--capture-error))
      (when dagger--block-error
        (error "Block failed (%s)" dagger--block-error)))

    (defun dagger-init-file (orgfile &optional no-cache)
      "Execute init bash blocks (those with :init yes) in ORGFILE.
When NO-CACHE is non-nil, ignore cached results.
Stops at first failure."
      (find-file orgfile)
      (org-babel-map-src-blocks nil
        (let* ((info (org-babel-get-src-block-info t))
               (params (nth 2 info)))
          (when (and (string= lang "bash")
                     (assq :init params))
            (message "%s Init %s..." (format-time-string "%H:%M:%S")
                     (or (org-element-property :name (org-element-at-point)) "(unnamed)"))
            (if no-cache
                (dagger--execute-or-die info '((:cache . "no")))
              (dagger--execute-or-die)))))
      (save-buffer)
      (kill-buffer))

    ;;; run.el ends here
  #+end_src

* Run script (host)
  :PROPERTIES:
  :ID:       a7f2c1d8-3e5b-4a9f-b6c2-8d4e1f0a5b3c
  :END:

  Executes org-babel blocks using host emacs in batch mode and saves
  the results. Populates the =#+RESULTS:= blocks that tangling writes
  to =tests/expected/= via noweb references.  The daily-use =run.sh=
  wrapper runs this inside a container for reproducibility.

  #+begin_src bash :tangle run-host.sh :shebang "#!/usr/bin/env bash" :noweb yes
  # Execute org-babel blocks and save results.
  # Usage:
  #   ./run.sh                              # run all src and doc org files
  #   ./run.sh --no-cache                   # ignore cached results
  #   ./run.sh src/foo.org                  # run a specific file
  set -eu

  SCRIPT_DIR="$(cd "$(dirname "$0")" && pwd)"

  NO_CACHE=
  if [ "${1:-}" = "--no-cache" ]; then
      NO_CACHE=1
      shift
  fi

  <<ensure-org>>

  export PATH="$SCRIPT_DIR/tests:$PATH"

  run_file() {
      local orgfile="$1"
      echo "Running $orgfile..."
      local raw_output rc=0 no_cache_arg=""
      if [ -n "$NO_CACHE" ]; then
          no_cache_arg="t"
      fi
      emacs --batch --no-init-file \
          -l "$SCRIPT_DIR/tangle.el" \
          -l "$SCRIPT_DIR/run.el" \
          --eval "(dagger-run-file \"$orgfile\" $no_cache_arg)" 2>&1 || rc=$?
      if [ "$rc" -ne 0 ]; then
          echo "ERROR: emacs run failed (exit $rc)" >&2
          return "$rc"
      fi
  }

  if [ $# -eq 0 ]; then
      for f in "$SCRIPT_DIR"/src/*.org "$SCRIPT_DIR"/examples/*/readme.org; do
          [ -f "$f" ] && run_file "$f"
      done
  else
      for f in "$@"; do
          test -f "$(realpath "$f")" # assert thanks to set -eu
          run_file "$(realpath "$f")"
      done
  fi
  #+end_src

* Init examples (host)

  Runs =:init yes= bash blocks in example readme.org files to
  set up their dagger modules (=dagger init=, =dagger install=,
  local checkout rewrite).  The daily-use =init-examples.sh= wrapper
  runs this inside a container for reproducibility.

  With =--from-scratch=, first removes everything except
  =readme.org= in each example directory.

  #+begin_src bash :tangle init-examples-host.sh :shebang "#!/usr/bin/env bash" :noweb yes
  # Initialize example dagger modules.
  # Usage:
  #   ./init-examples.sh                       # init all examples
  #   ./init-examples.sh --no-cache            # ignore cached results
  #   ./init-examples.sh --from-scratch        # clean + init (implies --no-cache)
  #   ./init-examples.sh examples/foo/readme.org  # init a specific example
  set -eu

  SCRIPT_DIR="$(cd "$(dirname "$0")" && pwd)"

  NO_CACHE=
  FROM_SCRATCH=
  while [ "${1:-}" = "--no-cache" ] || [ "${1:-}" = "--from-scratch" ]; do
      case "$1" in
          --no-cache) NO_CACHE=1; shift ;;
          --from-scratch) FROM_SCRATCH=1; NO_CACHE=1; shift ;;
      esac
  done

  if [ -n "$FROM_SCRATCH" ]; then
      for d in "$SCRIPT_DIR"/examples/*/; do
          find "$d" -mindepth 1 -not -name readme.org -delete 2>/dev/null || true
          find "$d" -mindepth 1 -type d -empty -delete 2>/dev/null || true
      done
  fi

  <<ensure-org>>

  init_file() {
      local orgfile="$1"
      local example_dir
      example_dir="$(dirname "$orgfile")"
      echo "Init $orgfile..."
      local raw_output rc=0 no_cache_arg=""
      if [ -n "$NO_CACHE" ]; then
          no_cache_arg="t"
      fi
      raw_output=$(emacs --batch --no-init-file \
          -l "$SCRIPT_DIR/tangle.el" \
          -l "$SCRIPT_DIR/run.el" \
          --eval "(dagger-init-file \"$orgfile\" $no_cache_arg)" 2>&1) || rc=$?
      if [ "$rc" -ne 0 ]; then
          echo "ERROR: init failed (exit $rc):" >&2
          echo "$raw_output" >&2
          return "$rc"
      fi
      local djson="$example_dir/dagger.json"
      if [ -f "$djson" ]; then
          local dir_name
          dir_name="$(basename "$example_dir")"
          python3 -c "
  import json, sys
  p, want = sys.argv[1], sys.argv[2]
  d = json.load(open(p))
  if d.get('name') != want:
      print(f'Setting module name to {want!r} in {p}')
      d.pop('name', None)
      d = {'name': want, **d}
      json.dump(d, open(p, 'w'), indent=2)
      print()
  " "$djson" "$dir_name"
      fi
  }

  if [ $# -eq 0 ]; then
      for f in "$SCRIPT_DIR"/examples/*/readme.org; do
          [ -f "$f" ] && init_file "$f"
      done
  else
      for f in "$@"; do
          test -f "$(realpath "$f")"
          init_file "$(realpath "$f")"
      done
  fi
  #+end_src

* Export HTML (host)

  Exports all publishable org files to HTML with noweb expansion.
  GitHub's org-mode renderer cannot expand noweb references, so we
  export to HTML via Emacs and publish to GitHub Pages.

  The script reuses =tangle.el= to load the pinned org-mode and
  configure babel, then exports each file with
  =org-html-export-to-html=.  File links (=[[file:foo.org]]=) are
  rewritten to point to =.html= so navigation works in the published
  site.

  #+begin_src bash :tangle export-html-host.sh :shebang "#!/usr/bin/env bash" :noweb yes
  # Export org files to HTML for GitHub Pages.
  set -euo pipefail

  SCRIPT_DIR="$(cd "$(dirname "$0")" && pwd)"

  <<ensure-org>>

  SITE_DIR="$SCRIPT_DIR/_site"
  rm -rf "$SITE_DIR"
  mkdir -p "$SITE_DIR"

  export_file() {
      local orgfile="$1"
      local relpath
      relpath="$(realpath --relative-to="$SCRIPT_DIR" "$orgfile")"
      local outdir="$SITE_DIR/$(dirname "$relpath")"
      mkdir -p "$outdir"
      echo "Exporting $relpath..."
      local rc=0
      emacs --batch --no-init-file \
          -l "$SCRIPT_DIR/tangle.el" \
          --eval "(progn
                    (require 'ox-html)
                    (find-file \"$orgfile\")
                    ;; Rewrite file: links from .org to .html
                    (setq org-html-link-org-files-as-html t)
                    (org-html-export-to-html)
                    (kill-buffer))" 2>&1 || rc=$?
      if [ "$rc" -ne 0 ]; then
          echo "ERROR: export failed for $relpath (exit $rc)" >&2
          return "$rc"
      fi
      local htmlfile="${orgfile%.org}.html"
      if [ -f "$htmlfile" ]; then
          mv "$htmlfile" "$outdir/"
      fi
  }

  for f in "$SCRIPT_DIR"/readme.org "$SCRIPT_DIR"/TECHNICAL.org \
           "$SCRIPT_DIR"/src/*.org "$SCRIPT_DIR"/tests/*.org \
           "$SCRIPT_DIR"/examples/*/readme.org; do
      [ -f "$f" ] && export_file "$f"
  done

  # Root readme becomes index.html
  if [ -f "$SITE_DIR/readme.html" ]; then
      cp "$SITE_DIR/readme.html" "$SITE_DIR/index.html"
  fi
  #+end_src

* Containerized wrappers

  The daily-use scripts run their host counterparts inside a Dagger
  container for reproducible emacs output.  Each wrapper calls the
  corresponding =dind-*= function and exports the result back to the
  working tree with =-o .=.

** run.sh

   #+begin_src bash :tangle run.sh :shebang "#!/usr/bin/env bash"
   set -eu
   cd "$(dirname "$0")"
   args=""
   if [ "${1:-}" = "--no-cache" ]; then
       args="--no-cache"
       shift
   fi
   for f in "$@"; do
       args="$args --files=$f"
   done
   exec dagger ${DAGGER_EXTRA_ARGS:-} call dind-run-org $args -o .
   #+end_src

** tangle.sh

   #+begin_src bash :tangle tangle.sh :shebang "#!/usr/bin/env bash"
   set -eu
   cd "$(dirname "$0")"
   exec dagger ${DAGGER_EXTRA_ARGS:-} call dind-tangle -o .
   #+end_src

** init-examples.sh

   #+begin_src bash :tangle init-examples.sh :shebang "#!/usr/bin/env bash"
   set -eu
   cd "$(dirname "$0")"
   args=""
   if [ "${1:-}" = "--from-scratch" ]; then
       args="--from-scratch"
       shift
   elif [ "${1:-}" = "--no-cache" ]; then
       args="--no-cache"
       shift
   fi
   exec dagger ${DAGGER_EXTRA_ARGS:-} call dind-init-examples $args -o .
   #+end_src

** export-html.sh

   #+begin_src bash :tangle export-html.sh :shebang "#!/usr/bin/env bash"
   set -eu
   cd "$(dirname "$0")"
   exec dagger ${DAGGER_EXTRA_ARGS:-} call export-html export --path _site
   #+end_src
