export-html-host.sh

SITE_DIR="$SCRIPT_DIR/_site"
rm -rf "$SITE_DIR"
mkdir -p "$SITE_DIR"

export_file() {
    local orgfile="$1"
    local relpath
    relpath="$(realpath --relative-to="$SCRIPT_DIR" "$orgfile")"
    local outdir="$SITE_DIR/$(dirname "$relpath")"
    mkdir -p "$outdir"
    echo "Exporting $relpath..."
    local rc=0
    emacs --batch --no-init-file \
        -l "$SCRIPT_DIR/tangle.el" \
        --eval "(progn
                  (require 'ox-html)
                  (find-file \"$orgfile\")
                  ;; Rewrite file: links from .org to .html
                  (setq org-html-link-org-files-as-html t)
                  (org-html-export-to-html)
                  (kill-buffer))" 2>&1 || rc=$?
    if [ "$rc" -ne 0 ]; then
        echo "ERROR: export failed for $relpath (exit $rc)" >&2
        return "$rc"
    fi
    local htmlfile="${orgfile%.org}.html"
    if [ -f "$htmlfile" ]; then
        mv "$htmlfile" "$outdir/"
    fi
}

for f in "$SCRIPT_DIR"/readme.org "$SCRIPT_DIR"/TECHNICAL.org \
         "$SCRIPT_DIR"/src/*.org "$SCRIPT_DIR"/tests/*.org \
         "$SCRIPT_DIR"/examples/*/readme.org; do
    [ -f "$f" ] && export_file "$f"
done

# Root readme becomes index.html
if [ -f "$SITE_DIR/readme.html" ]; then
    cp "$SITE_DIR/readme.html" "$SITE_DIR/index.html"
fi
# Export HTML (host):1 ends here
