init-examples-host.sh
    local example_dir
    example_dir="$(dirname "$orgfile")"
    echo "Init $orgfile..."
    local raw_output rc=0 no_cache_arg=""
    if [ -n "$NO_CACHE" ]; then
        no_cache_arg="t"
    fi
    raw_output=$(emacs --batch --no-init-file \
        -l "$SCRIPT_DIR/tangle.el" \
        -l "$SCRIPT_DIR/run.el" \
        --eval "(dagger-init-file \"$orgfile\" $no_cache_arg)" 2>&1) || rc=$?
    if [ "$rc" -ne 0 ]; then
        echo "ERROR: init failed (exit $rc):" >&2
        echo "$raw_output" >&2
        return "$rc"
    fi
    local djson="$example_dir/dagger.json"
    if [ -f "$djson" ]; then
        local dir_name
        dir_name="$(basename "$example_dir")"
        python3 -c "
import json, sys
p, want = sys.argv[1], sys.argv[2]
d = json.load(open(p))
if d.get('name') != want:
    print(f'Setting module name to {want!r} in {p}')
    d.pop('name', None)
    d = {'name': want, **d}
    json.dump(d, open(p, 'w'), indent=2)
    print()
" "$djson" "$dir_name"
    fi
}

if [ $# -eq 0 ]; then
    for f in "$SCRIPT_DIR"/examples/*/readme.org; do
        [ -f "$f" ] && init_file "$f"
    done
else
    for f in "$@"; do
        test -f "$(realpath "$f")"
        init_file "$(realpath "$f")"
    done
fi
# Init examples (host):1 ends here
